[
  {
    "id": 1,
    "chapter": "第一品  法會因由分",
    "text": "如是我聞：一時，佛在舍衛國祇樹給孤獨園，與大比丘眾千二百五十人俱。爾時，世尊食時，著衣持鉢，入舍衛大城乞食。於其城中，次第乞已，還至本處。飯食訖，收衣鉢，洗足已，敷座而坐。",
    "note": "我曾經聽佛陀說過：當時佛陀與僧眾一同住在祇園精舍。到午飯時間，他穿好袈裟、托著缽，進城乞食（化緣）。回來後用完齋飯，佛陀清洗雙足、整理衣物，然後安靜入座。"
  },
  {
    "id": 2,
    "chapter": "第二品  善現啟請分",
    "text": "時，長老須菩提在大眾中，即從座起，偏袒右肩，右膝著地，合掌恭敬而白佛言：「希有，世尊！如來善護念諸菩薩，善付囑諸菩薩。世尊，善男子、善女人發阿耨多羅三藐三菩提心，云何應住？云何降伏其心？」\n佛言：「善哉，善哉，須菩提！如汝所說，如來善護念諸菩薩，善付囑諸菩薩。汝今諦聽，當為汝說。善男子、善女人，發阿耨多羅三藐三菩提心，應如是住，如是降伏其心。」\n須菩提言：「唯然，世尊，願樂欲聞。」",
    "note": "這時，弟子須菩提從座位起身，袒露右肩、右膝著地，雙手合十，恭敬地向佛請示：「世尊，像您這樣常憶念與護持諸大菩薩，實在太難得了。弟子想請問，若有善男子善女人發願修行無上的佛道，應當如何安住其心？又該如何降伏種種妄念與煩惱？」\n佛陀回答：「很好，須菩提。你所提的正是如來護念菩薩、囑咐菩薩之義。你現在要專心聽，我會為你解說，若有發阿耨多羅三藐三菩提心的修行人，就該這樣安住與降伏其心。」\n須菩提說：「是，世尊。我非常樂意聽聞您的開示。」"
  },
  {
    "id": 3,
    "chapter": "第三品  大乘正宗分",
    "text": "「須菩提，諸菩薩摩訶薩，應如是降伏其心。\n所有一切眾生之類，若卵生，若胎生，若濕生，若化生；\n若有色，若無色；若有想，若無想，若非有想非無想，\n我皆令入無餘涅槃而滅度之。\n如是滅度無量無數無邊眾生，實無有眾生得滅度者。\n何以故？須菩提，若菩薩有我相、人相、眾生相、壽者相，\n即非菩薩。」",
    "note": "佛陀教導弟子，應當發願度化一切眾生，不論是卵生的、胎生的、濕身的（從潮濕、腐爛這些有濕氣的環境中自然形成的生命體）、化生的（不經父母交合、無需胎卵生的生命，例如天界眾生、地獄眾生，但我原本以為是阿米巴蟲）有形有識、無形無識、有心的意識或是沒有的、甚至已超越分別的生命，我都要讓他們達到脫離生死輪迴的涅槃來解脫，但事實上卻沒有什麼眾生真實得到解脫，這是為什麼呢？須菩提，如果菩薩心中有自己相的樣貌，那麼他就不是菩薩。"
  },
  {
    "id": 4,
    "chapter": "第四品  妙行無住分",
    "text": "「復次，須菩提，菩薩於法，應無所住，行於布施。所謂不住色布施，不住聲、香、味、觸、法布施。須菩提，菩薩應如是布施，不住於相。何以故？若菩薩不住相布施，其福德不可思量。\n須菩提，於意云何？東方虛空可思量不？」\n「不也，世尊。」\n「須菩提，南西北方，四維上下虛空，可思量不？」\n「不也，世尊。」\n「須菩提，菩薩無住相布施，福德亦復如是不可思量。須菩提，菩薩但應如所教住。」",
    "note": "佛陀說：菩薩在行布施時，應該心無所住，不執著於聲音、氣味、觸感等任何對象。若能這樣布施，所累積的福德將無法以常理衡量。\n例如東方的虛空，你能量出它的大小嗎？不能。四方上下亦然。\n同樣地，菩薩若能不執著於所施對象，那麼福德也像虛空一般無限。菩薩應依此教導而修行。"
  },
  {
    "id": 5,
    "chapter": "第五品  如理實見分",
    "text": "「須菩提，於意云何？可以身相見如來不？」\n「不也，世尊。不可以身相得見如來。何以故？如來所說身相，即非身相。」\n佛告須菩提：「凡所有相，皆是虛妄。若見諸相非相，即見如來。」",
    "note": "佛問須菩提：『你認為可以透過外在的身相來認出佛嗎？』\n須菩提回答：『不行。佛所說的身相，其實不是真實的身相。』\n佛陀接著說：『凡是有相的現象，都是虛幻的。\n若能理解這一點，看見一切表相皆非實相，這樣才能真正體會佛的本質。"
  },
  {
  "id": 6,
  "chapter": "第六品  正信希有分",
  "text": "須菩提白佛言：「世尊，頗有眾生，得聞如是言說章句，生實信不？」\n佛告須菩提：「莫作是說。如來滅後，後五百歲，有持戒修福者，於此章句，能生信心，以此為實，當知是人，不於一佛、二佛、三、四、五佛而種善根，已於無量千萬佛所種諸善根。聞是章句，乃至一念生淨信者，如來悉知悉見，是諸眾生，得如是無量福德。何以故？是諸眾生無復我相、人相、眾生相、壽者相，無法相，亦無非法相。何以故？是諸眾生，若心取相，即為著我、人、眾生、壽者。若取法相，即著我、人、眾生、壽者；若取非法相，即著我、人、眾生、壽者。是故不應取法，不應取非法。以是義故，如來常說：『汝等比丘知我說法，如筏喻者。法尚應捨，何況非法。』",
  "note": "須菩提問佛：未來的世界還有人能真正相信這樣深奧的話嗎？\n佛回答：千萬不要低估未來人的信心。雖然我將入滅，但在五百年後，還是會有人聽到這些經文，生起堅定不動搖的信心。他們不是第一次接觸佛法，而是早已在無數佛前種下深厚善根。\n哪怕只是短暫生起一念清淨的信心，佛都完全知曉。這些人將獲得無法想像的福德，因為他們的內心沒有執著『我』、沒有分別『人』、『眾生』或『壽命』，甚至連佛法本身也不執取。\n佛說，若心中執著任何相──無論是「我是誰」的想法，或對法、非法的分別──其實都是把自我黏在表象上。\n真正的修行是：不取、不執。\n佛法本身，也只是帶我們渡河的工具；就像竹筏一樣，到達彼岸後也該放下，更何況那些不是正法的見解？\n這就是為什麼佛常說：「連法都該捨，遑論非法。」"
  },
  {
    "id": 7,
    "chapter": "第七品  無得無說分",
    "text": "「須菩提，於意云何？如來得阿耨多羅三藐三菩提耶？如來有所說法耶？」\n須菩提言：「如我解佛所說義，無有定法名阿耨多羅三藐三菩提，亦無有定法如來可說。何以故？如來所說法，皆不可取、不可說，非法、非非法。所以者何？一切賢聖皆以無為法而有差別。」",
    "note": "佛問須菩提：『你覺得我有真正獲得無上正等正覺嗎？我有講過任何確定的法嗎？』\n須菩提回答：『依我對佛法的理解，佛陀所說的道理而且不屬於某一套固定的法門，也沒有所謂的“這個才是真正的佛法”。因為如來所說的教法，既不能被執取，也不該被固化為某種概念或語言。既不是“有法”，也不能說是“無法”。』\n為什麼會這樣？因為真正證悟的聖者，都是從無為的境界中覺悟的。他們不是從抓住某個法則中得道的，而是在超越語言與形式的空性中體會到真實。所以真正的智慧與解脫，而且不是來自「獲得某法」，而是在「無所得」中自然流露。"
  },
  {
    "id": 8,
    "chapter": "第八品  依法出生分",
    "text": "須菩提，於意云何？若人滿三千大千世界七寶，以用布施，是人所得福德寧為多不？\n須菩提言：甚多，世尊。何以故？是福德，即非福德性，是故如來說福德多。\n若復有人於此經中，受持乃至四句偈等，為他人說，其福勝彼。何以故？須菩提，一切諸佛及諸佛阿耨多羅三藐三菩提法，皆從此經出。須菩提，所謂佛法者，即非佛法。",
    "note": "佛陀問須菩提：「如果有人布施整整三千大千世界的七寶，這樣的福德是不是非常巨大？」\n須菩提回答：「非常多，世尊，確實是大福報。」\n佛陀說：「這只是從世俗的角度來說才認為福報大。其實，真正的福德不是在布施的數量，而是在於內心是否與真理相應。」\n「如果有人能夠信受而且實踐這部經典，哪怕只是其中的一小段，而且能為他人講說，這樣所累積的福德，會遠遠超過那用無數珍寶布施所得到的福報。」\n「為什麼呢？因為所有佛陀的智慧和他們所證得的最究竟覺悟，都是從這部經中誕生的。」\n「不過要記得，我所說的『佛法』也不是一個固定不變的東西。所謂的佛法，若執著有一個確定的樣貌，那就不是佛法了。」"
  },
  {
    "id": 9,
    "chapter": "第九品  一相無相分",
    "text": "須菩提，於意云何？須陀洹能作是念：我得須陀洹果不？\n須菩提言：不也，世尊。何以故？須陀洹果名為入流，而無所入。\n不入色、聲、香、味、觸、法，是名須陀洹。\n須菩提，於意云何？斯陀含能作是念：我得斯陀含果不？\n須菩提言：不也，世尊。何以故？斯陀含名一往來，而實無往來，是名斯陀含。\n須菩提，於意云何？阿那含能作是念：我得阿那含果不？\n須菩提言：不也，世尊。何以故？阿那含名為不來，而實無不來，是名阿那含。\n須菩提，於意云何？阿羅漢能作是念：我得阿羅漢道不？\n須菩提言：不也，世尊。何以故？實無有法名阿羅漢。\n世尊，若阿羅漢作是念：我得阿羅漢道，即為著我、人、眾生、壽者。\n世尊說我得無諍三昧，人中最為第一，是第一離欲阿羅漢。\n世尊，我不作是念：我是離欲阿羅漢。\n若作是念：我得阿羅漢道，世尊則不說須菩提是樂阿蘭那行者。\n以須菩提實無所行，而名須菩提是樂阿蘭那行。",
    "note": "你認為一個人證得初果（須陀洹果位）後，\n是否能說「我已經成為須陀洹果位的人了」？\n不行，因為須陀洹果的意涵是：\n此人已脫離對色、聲、香、味、觸、法等六塵的執著，\n不再受感官所牽引，\n就像河水不再流向欲望之地，\n這才是真正的「入流」，也才是真正的須陀洹果位。\n那他可以認為自己已證得阿那含果嗎？\n也不行。阿那含的意思是「不來」，\n而非真的有什麼地方「不來」，是心中不再住於任何執著。\n同樣的，如果有人說：「我得阿羅漢道，\n因此我不再執著任何法相」，這樣的說法也不對，\n因為「得道」的意思不是口頭宣稱，\n是徹底斷除內心的貪愛與無明，\n進入清明不動的境界，這才是阿羅漢的實證。\n如果以為自己「證得」了什麼，\n那其實還在「有所得」的錯覺裡，\n阿羅漢不會有這樣的念頭。\n佛說：「若我說須菩提得阿羅漢道，\n那就不是實語，不是究竟法了。因為須菩提所證，\n是超越言語與概念的無住之道，\n他才是真正修行寂靜解脫的行者。」"
  },
  {
    "id": 10,
    "chapter": "第十品  莊嚴淨土分",
    "text": "佛告須菩提：「於意云何？如來昔在然燈佛所，於法有所得不？」\n「不也，世尊。」\n「須菩提，於意云何？菩薩莊嚴佛土不？」\n「不也，世尊。何以故？莊嚴佛土者，即非莊嚴，是名莊嚴。」\n「是故，須菩提，諸菩薩摩訶薩，應如是生清淨心：不應住色生心，不應住聲、香、味、觸、法生心；應無所住而生其心。」\n「須菩提，譬如有人，身如須彌山王，於意云何？是身為大不？」\n須菩提言：「甚大，世尊。何以故？佛說非身，是名大身。」",
    "note": "佛問須菩提：「你認為我過去在然燈佛那裡，有沒有真正獲得什麼法呢？」\n須菩提回答：「沒有，世尊。您在然燈佛那裡其實沒有獲得任何東西。」\n佛說：「那些發心修行的大菩薩若想要莊嚴佛國土，實際上而且不是真正去裝飾什麼，那種『莊嚴』其實是無所執著的莊嚴。\n所以，大菩薩應當發出一種純淨無染的心，不應該因為聲音、顏色、氣味、接觸、想法這些感官經驗來生起貪著與執念，應該在無所執著中發心。」\n佛又說：「就像如果有個人身體像須彌山一樣巨大，你覺得這樣的身體算大嗎？」\n須菩提說：「很大，世尊。因為佛說所謂的『大身』而且不是真的以形體為大，而是脫離對身相的執著，才能名為真正的大身。」"
  },
  {
    "id": 11,
    "chapter": "第十一品  無為福勝分",
    "text": "須菩提：「如恆河中所有沙，諸恆河沙寧為多不？」\n須菩提言：「甚多，世尊。但諸恆河尚多無數，何況其沙。」\n須菩提：「我今實言告汝，若有善男子、善女人，以七寶滿所恆河沙數三千大千世界，以用布施，得福多不？」\n須菩提言：「甚多，世尊。」\n佛告須菩提：「若善男子、善女人，於此經中，乃至受持四句偈等，為他人說，而此福德勝前福德。」",
    "note": "佛問須菩提：「你覺得恆河裡的沙多不多？」\n須菩提回答：「非常多，世尊，因為光是恆河的數量就已經很多了，更何況裡面的沙子呢？」\n佛又說：「如果有個善男子或善女人，用滿河沙那麼多的七寶來布施三千大千世界，這樣的福報會不會很多？」\n須菩提答：「真的很多，世尊。」\n佛陀接著說：「但如果有人只是從這部經中受持、記住、理解，甚至只是一首四句偈，然後把它傳達給別人聽，那麼這樣做所得到的福報，還要超過前面所說用寶物布施的功德。」"
  },
  {
    "id": 12,
    "chapter": "第十二品  尊重正教分",
    "text": "「復次，須菩提，\n隨說是經，乃至四句偈等，\n當知此處，一切世間天、人、阿修羅，皆應供養，如佛塔廟。\n何況有人盡能受持、讀誦。\n須菩提，當知是人，成就最上第一希有之法。\n若是經典所在之處，即為有佛，若尊重弟子。」",
    "note": "佛接著說：「須菩提，如果有人即使只是講解這部經中的一句或四句偈語，這個地方也值得被所有天人與阿修羅敬仰與供養，就像對待佛塔一樣。\n如果還有人能完整記誦這部經，那麼這個人已經實踐而且成就了最高難得的法門。\n凡是有這部經典存在的地方，就等同於有佛存在，也等同於是佛的親傳弟子所在之地，因此應該深深尊重這地方。」"
  },
  {
    "id": 13,
    "chapter": "第十三品  如法受持分",
    "text": "須菩提白佛言：「世尊，當何名此經？我等云何奉持？」\n佛告須菩提：「是經名為《金剛般若波羅蜜》。以是名字，汝當奉持。何以故？須菩提，如來說般若波羅蜜，即非般若波羅蜜，是名般若波羅蜜。\n須菩提，於意云何？如來有所說法不？」\n須菩提言：「世尊，如來無所說。」\n須菩提，若三千大千世界所有微塵，是為多不？」\n須菩提言：「甚多，世尊。」\n須菩提，如一微塵，如來說非微塵，是名微塵。如來說世界，非世界，是名世界。\n須菩提，於意云何？可以三十二相觀如來不？」\n須菩提言：「不也，世尊。不可以三十二相得觀如來。何以故？如來說三十二相，即是非相，是名三十二相。」\n佛告須菩提：「若有善男子、善女人，以恒河沙等身命布施，若復有人於此經中，乃至受持四句偈等，為他人說，其福甚多。」",
    "note": "須菩提問佛：「世尊，我們應該用什麼名稱來稱呼這部經典？又該如何好好奉持它呢？」\n佛回答：「這部經叫做《金剛般若波羅蜜經》。你們就用這個名字來記住它、傳誦它。為什麼這樣說呢？因為佛所說的『般若波羅蜜』，其實不是真正有個實體的東西，而是名字的方便說法。」\n佛又問：「你認為佛真的有說法嗎？」\n須菩提回答：「其實而且沒有，佛而且沒有固定說什麼法。」\n佛又舉例說：「如果把三千大千世界裡的微塵都算起來，是不是很多？」\n須菩提說：「真的很多！」\n佛說：「但佛所說的『微塵』，不是實體的微塵，而只是名稱上的指稱。世界也一樣，佛說『世界』，但那也不是真正的世界，只是個名稱罷了。」\n接著佛問：「可以從三十二相來看見如來嗎？」\n須菩提說：「不可以，因為三十二相不代表真正的佛。真正的佛超越了所有外在形象。」\n佛總結說：「如果有人能用自己的生命，像恆河沙數那麼多次去布施，確實功德很大。但若有人能受持這部經典中的四句偈，而且教導他人，所得到的福報會更加不可思議。」"
  },
  {
    "id": 14,
    "chapter": "第十四品  離相寂滅分",
    "text": "爾時，須菩提聞說是經，深解義趣，涕淚悲泣而白佛言：「\n「希有，世尊！佛說如是甚深經典，我從昔來，所得慧眼，未曾得聞如是之經。\n世尊，若復有人得聞是經，信心清淨，即生實相，當知是人，成就第一希有功德。\n世尊，是實相者，即是非相，是故如來說名實相。\n世尊，我今得聞如是經典，信解受持，不足為難。\n若當來世後五百歲，其有眾生得聞是經，信解受持，是人即為第一希有。\n何以故？此人無我相、無人相、無眾生相、無壽者相，所以者何？我相即是非相，人相、眾生相、壽者相即是非相。\n何以故？離一切諸相，即名諸佛。」\n佛告須菩提：「如是，如是。若復有人得聞是經，不驚，不怖，不畏，當知是人甚爲希有。何以故？須菩提，如來說第一波羅蜜，即非第一波羅蜜，是名第一波羅蜜。」\n「須菩提，忍辱波羅蜜，如來說非忍辱波羅蜜，是名忍辱波羅蜜。何以故？須菩提，如我昔為歌利王割截身體，我於爾時無我相、無人相、無眾生相、無壽者相。何以故？我於往昔節節支解時，若有我相、人相、眾生相、壽者相，應生瞋恨。須菩提，又念過去於五百世作忍辱仙人，於爾所世，無我相、無人相、無眾生相、無壽者相。是故，須菩提，菩薩應離一切相，發阿耨多羅三藐三菩提心。不應住色生心，不應住聲、香、味、觸、法生心，應生無所住心。若心有住，即為非住。是故，佛說菩薩心不應住色布施。須菩提，菩薩為利益一切眾生故，應如是布施。『如來說一切諸相即是非相，又說一切眾生即非眾生。』\n須菩提，如來是真語者、實語者、不誑語者、不異語者。須菩提，如來所得法，此法無實無虛。須菩提，若菩薩心住於法而行布施，如人入闇，即無所見；若菩薩心不住法而行布施，如人有目，日光明照，見種種色。\n「須菩提，當來之世，若有善男子、善女人能於此經受持讀誦，即為如來，以佛智慧，悉知是人，悉見是人，皆得成就無量無邊功德。」",
    "note": "當時，須菩提聽完佛所講的這部經文，深受感動，流下眼淚，對佛說：\n「世尊，太稀有了！您說的這些道理如此深奧，我從過去修行以來，雖有智慧，但從未聽過這樣的內容。\n如果有人聽聞這部經文，內心清淨產生信心，那他就能夠領悟真實的本質，也將獲得極高功德。\n所謂的『真實』，其實不是一種固定的樣貌，因此佛才說這叫『真實相』。\n我現在能聽到而且理解這些道理，對我來說不困難。\n但未來的五百年後，若還有人能夠信受奉行這部經，那真的是極為難得。\n因為這樣的人已經沒有我、人、眾生、生命長短的分別之心。\n這些分別本身就不是究竟，放下一切執著才是真正理解佛的智慧。」\n佛回答須菩提：「沒錯沒錯。\n如果有人聽了這經文而不感到害怕或困惑，那他是非常罕見的人。\n為什麼呢？因為所謂的『波羅蜜』（圓滿的德行），佛其實說它不是什麼特定的德行，這才是真正的圓滿。」\n「比如說忍辱，佛說這也不是單單忍受的概念，而是要超越對『我』或『人』的認定。\n我在過去被歌利王割截身體時，之所以沒有生氣，是因為我心中沒有任何執著於『我是誰』或『他是誰』的分別。\n我在那時候就已經沒有自我的概念了，所以才能做到真正的忍辱。\n因此，修行人應該放下所有對現象的執著，才能發起真正成佛的心。\n不要因為看到色、聲、香、味、觸、念而生起反應，心要保持不黏著的狀態。\n如果有黏著，那就已經偏離了清淨之道。」\n「所以佛才會說，布施時不能執著在外相上。\n為了利益眾生，布施必須超越表象。\n一切相都不是真實相，一切眾生也不應被當成固定的存在。」\n「佛所說的法，既不是實有也不是虛無，是圓滿無礙的智慧。\n如果有人在布施時對所布施的東西產生執著，就像瞎子一樣什麼都看不見；\n但如果能放下執著去布施，就像眼睛明亮的人在陽光下看見萬物分明。\n未來的世間，如果有善男子、善女子能夠誠心受持這部經，讀誦理解，佛以智慧完全了解，且見到這樣的人，\n因為他們將會圓滿無量的功德。"
  },
  {
    "id": 15,
    "chapter": "第十五品  持經功德分",
    "text": "「須菩提，若有善男子、善女人，初日分以恒河沙等身布施，\n中日分亦以恆河沙等身布施，\n後日分亦以恆河沙等身布施；\n如是無量百千萬億劫，以身布施。\n若復有人，聞此經典，信心不逆，其福勝彼。\n何況書寫、受持、讀誦、為人解說。」\n「須菩提，以要言之，是經有不可思議、不可稱量、無邊功德。\n如來為發大乘者說，為發最上乘者說。\n若有人能受持、讀誦、廣為人說，如來悉知是人，悉見是人，\n皆得成就不可量、不可稱、無有邊、不可思議功德。\n如是人等，即為荷擔如來阿耨多羅三藐三菩提。」\n「何以故？須菩提，若樂小法者，著我見、人見、眾生見、壽者見，\n即於此經，不能聽受、讀誦、為人解說。」\n「須菩提，在在處處，若有此經，一切世間天人、阿修羅所應供養，\n當知此處，即為是塔，皆應恭敬、作禮圍繞，以諸華香，而散其處」",
    "note": "須菩提，假如有個修行者，早、中、晚三次都能拿出像恒河沙那樣多的身體性命來布施，\n經過無數億萬劫都這樣做，這樣的功德當然很大。\n但如果有人聽到這部經後，心中信受不懷疑，那他的福德還超過前者。\n更別說有人抄寫、受持、朗讀、講解這部經典，那功德更是難以估量。\n為什麼呢？因為這部經的功德無邊，難以想像。\n如來是為那些發願走菩薩道、想成就無上智慧的人說這部經的。\n誰能受持誦讀且向他人講解，就是如來心中真正的修行者，\n如來能知、能見這些人，\n他們將成就無量無邊、不可思議的功德，\n等同於承擔起幫助眾生成佛的重任。\n為什麼呢？因為若還執著小乘教法、執著「我」、「他」、「眾生」、「壽命」這些概念的人，\n根本無法真正接受、誦讀、理解與講解這部經典。\n所以，不論這部經在哪裡出現，\n那裡就值得所有人、天神、阿修羅來供養、敬禮與繞塔，\n那裡就是佛塔所在，應該用香花供養、莊嚴那處。"
  },
  {
    "id": 16,
    "chapter": "第十六品  能淨業障分",
    "text": "「復次，須菩提，若善男子，善女人受持誦此經，若為人輕賤，是人先世罪業應墮惡道，以今世人輕賤故，先世罪業即為消滅，當得阿耨多羅三藐三菩提。」\n「須菩提，我念過去無量阿僧祇劫，於然燈佛前，得值八百四千萬億那由他諸佛，悉皆供養承事，無空過者。若復有人於後末世，能受持讀誦此經，所得功德，於我所供養諸佛功德，百分不及一，千萬億分乃至算數，譬喻所不能及。」\n「須菩提，若善男子，善女人於後末世，有受持讀誦此經，所得功德，我若具說者，或有人聞，心即狂亂，狐疑不信。須菩提，當知是經義不可思議，果報亦不可思議。」",
    "note": "再說一次，須菩提，如果有善男子或善女人恭敬受持而且朗誦這部經典，即使他們在人世間受到輕視，那其實是他們過去的惡業正在消除，這樣一來，他們未來將有機會證得最究竟的覺悟。\n須菩提，我回想無數劫以前，在燃燈佛面前供養、服務，從不曾懈怠或缺失。\n但將來若有人在末法時代，能夠誦持這部經典，他們所累積的功德，即使與我過去供養所有諸佛相比，也遠遠超越，連百分之一都比不上，甚至千萬億分之一也難及。\n須菩提，若未來有人能受持讀誦這部經，他們的功德之巨大，若我詳細說明，恐怕聽聞的人會無法理解，甚至產生懷疑與困惑，不願相信。須菩提，你要知道，這部經的真義與受持誦念的果報不可思議，超乎世間能理解的範疇。"
  },
  {
    "id": 17,
    "chapter": "第十七品  究竟無我分",
    "text": "爾時，須菩提白佛言：「世尊，善男子、善女人，發阿耨多羅三藐三菩提心，云何應住？云何降伏其心？」\n佛告須菩提：「善男子、善女人，發阿耨多羅三藐三菩提心者，應生如是心：我應滅度一切眾生，滅度一切眾生已，而無有一眾生實滅度者。何以故？須菩提，若菩薩有我相、人相、眾生相、壽者相，即非菩薩。所以者何？須菩提，實無有法，發阿耨多羅三藐三菩者」\n須菩提，於意云何？如來於然燈佛所，有法得阿耨多羅三藐三菩提不？」\n「不也，世尊。如我解佛所說義，佛於然燈佛所，無有法得阿耨多羅三藐三菩提。」\n佛言：「如是。如是。須菩提，實無有法，如來得阿耨多羅三藐三菩提。須菩提，若有法，如來得阿耨多羅三藐三菩提者，然燈佛即不與我授記：『汝於來世當得作佛，號釋迦牟尼。』以實無有法得阿耨多羅三藐三菩提，是故然燈與我授記，作是言：『汝於來世當得作佛，號釋迦牟尼。』何以故？如來者，及諸法如義。\n若有人言：如來得阿耨多羅三藐三菩提，須菩提，實無有法，佛得阿耨多羅三藐三菩提。須菩提，如來得阿耨多羅三藐三菩提，於是中無實無虛。是故如來一切法皆是佛法。須菩提，所言一切法者，即非一切法，是故名一切法。須菩提，譬如人身長大。」\n須菩提言：「世尊，如來說人身長大，即為非大身，是名大身。」\n「須菩提，菩薩亦如是。若作是言：我當滅度無量眾生，即不名菩薩。何以故？須菩提，是無有法名為菩薩。是故，佛說一切法無我、無人、無眾生、無壽者。須菩提，若菩薩作是言：我當莊嚴佛土，是不名菩薩。何以故？如來說莊嚴佛土者，即非莊嚴，是名莊嚴。須菩提，若菩薩通達無我法者，如來說名真是菩薩。」",
    "note": "這時，須菩提向佛請問：「世尊，如果有人立志成佛，發起無上正等正覺的願心，請問他應怎麼安住在這個發願的心中？又該怎麼調伏這顆心呢？」\n佛回答他：「如果有人發起了無上正等正覺之心，就應該這樣想：『我將幫助所有眾生離苦得樂，渡過生死苦海。』但在度化所有眾生之後，心中卻不應該認為真的有哪個眾生被我度化了。為什麼？因為只要你還執著『我是一個在度眾生的菩薩』這樣的身分概念，就還不是真正的菩薩。」\n佛接著說：「須菩提，你覺得有一個固定不變的法，叫作『無上正等正覺』可以被取得嗎？」\n須菩提回答：「不，世尊。依我對佛法的理解，佛在過去修行時，也不是因為抓住什麼特定的法才成佛的。」\n\n佛說：「是的，完全正確。其實所謂的無上正等正覺，而且不是從某個地方得到的。就像當年然燈佛預言我會成佛時，也不是因為我得到了什麼『東西』，才配得那個授記的。」\n「所以我們說，如來與萬法是相契合的。如果有人說：『佛得到了無上正等正覺』，那麼他其實是在誤解，因為這其中而且沒有真實也沒有虛妄。所謂的一切法，都是佛法，但也同時不是你以為的那種『法』。」\n「須菩提，就像你看到一個人身材高大，但真正的高大，而且不是來自外表，而是來自於他內心的清明與解脫。」\n須菩提說：「世尊，原來佛所說的『高大之身』，其實不是指外在的身體形相，而是一種無形無相的境界。」\n佛又說：「是的，菩薩也是如此。如果他心裡還想著『我要度化無數眾生』，那他就不是真正的菩薩。為什麼呢？因為真正的菩薩，而且不執著有一個『度眾生』的行為。」\n「所以佛說，一切法無我、無人、無眾生、無壽者，都是為了幫助我們放下執著。如果一個菩薩說：『我要打造一個莊嚴的佛國世界』，那他也還沒真正通達佛法的本質。真正的莊嚴是不可得的，萬物無一物可得，心念清淨，不起分別，才是真正的莊嚴。」\n「須菩提，當一位菩薩能夠徹底明白無我之法，他才是真正意義上的『菩薩』，這正是如來所認可的修行者。"
  },
  {
    "id": 18,
    "chapter": "第十八品  一體同觀分",
    "text": "須菩提，於意云何？如來有肉眼不？」\n「如是，世尊。如來有肉眼。」\n「須菩提，於意云何？如來有天眼不？」\n「如是，世尊。如來有天眼。」\n「須菩提，於意云何？如來有慧眼不？」\n「如是，世尊。如來有慧眼。」\n「須菩提，於意云何？如來有法眼不？」\n「如是，世尊。如來有法眼。」\n「須菩提，於意云何？如來有佛眼不？」\n「如是，世尊。如來有佛眼。」\n「須菩提，於意云何？如恆河中所有沙，佛說是沙不？」\n「如是，世尊。如來說是沙。」\n「須菩提，於意云何？如一恆河中所有沙等恆河，是諸恆河所有沙數佛世界，如是寧為多不？」\n「甚多，世尊。」\n佛告須菩提：「爾所國土中，所有眾生若干種心，如來悉知。何以故？如來說諸心，皆為非心，是名為心。所以者何？須菩提，過去心不可得，現在心不可得，未來心不可得。」",
    "note": "佛問：「須菩提，你認為佛是否有肉眼呢？」\n須菩提回答：「是的，世尊，佛有肉眼。」\n「那麼佛有天眼嗎？」\n「有的，世尊。」\n「佛是否也擁有慧眼？」\n「是的，世尊。」\n「法眼呢？」\n「也有，世尊。」\n「那佛是否具備佛眼？」\n「是的，佛具備佛眼。」\n佛又問：「你怎麼看？恒河中的沙子，佛說那是沙對嗎？」\n「是的，佛說那些是沙。」\n「如果每一粒沙都代表一條像恒河一樣大的河，這些河裡的沙又構成了無數佛國世界，你認為這樣多不多呢？」\n「非常多，世尊。」\n佛說：「在這麼多佛土中，所有眾生的心念千差萬別，但我都能清楚了知。為什麼呢？因為我說的『心』而且不是真實固定的東西，只是暫時的名詞罷了。無論是過去、現在，還是未來的心，其實都無法捉摸，無從找尋。」"
  },
  {
    "id": 19,
    "chapter": "第十九品  法界通化分",
    "text": "「須菩提，於意云何？若有人滿三千大千世界七寶以用布施，是人以是因緣得福多不？」\n「如是，世尊。此人以是因緣得福甚多。」\n「須菩提，若福德有實，如來不說得福德多。以福德無故，如來說得福德多。」",
    "note": "佛問須菩提：「你怎麼看？如果有個人，用滿三千大千世界的珍寶來布施，你覺得他會因此得到很多福報嗎？」\n須菩提回答：「是的，世尊。這樣的人因為這個因緣，福報一定非常多。」\n佛說：「如果福德是個真實不變的東西，我就不會說他得到了很多福報。正因為福報本質上是空性的，沒有固定不變，所以我才會說這樣的人得福報很多。」"
  },
  {
    "id": 20,
    "chapter": "第二十品  離色離相分",
    "text": "「須菩提，於意云何？如來可以具足色身見不？」\n「不也，世尊。如來不應以具足色身見。何以故？如來說具足色身，即非具足色身，是名具足色身」\n「須菩提，於意云何？如來可以具足諸相見不？」\n「不也，世尊。如來不應以具足諸相見。何以故？如來說諸相具足，即非具足，是名諸相具足。」",
    "note": "佛問：「須菩提，你認為能從外表看到佛的圓滿身相嗎？」\n須菩提回答：「不能，世尊。不能從這些色相來認識佛。為什麼呢？因為如來說的圓滿色身不是圓滿色身，只是名叫圓滿色身罷了。」\n佛又問：「那麼，你認為能從各種莊嚴的外在特徵去看出佛的真實嗎？」\n須菩提說：「也不能，世尊。不能從一切具足的形象來見佛。為什麼這樣說呢？因為佛說的『具足諸相』，其實只是名字，而且不是實質存在的『具足』。」"
  },
  {
    "id": 21,
    "chapter": "第二十一品  非說所說分",
    "text": "「須菩提，汝勿謂如來作是念：『我當有所說法。』莫作是念。何以故？若人言如來有所說法，即為謗佛，不能解我所說故。須菩提，說法者無法可說，是名說法。」\n爾時，慧命須菩提白佛言：「世尊，頗有眾生於未來世聞說是法，生信心不？」\n佛言：「須菩提，彼非眾生，非不眾生。何以故？須菩提，眾生眾生者，如來說非眾生，是名眾生。」",
    "note": "佛陀說：「須菩提啊，你不要以為如來心中有個想法：『我現在正在說法。』千萬不要這樣認為。為什麼呢？如果有人說如來真的說了什麼法，那就是誤解佛法，等於在毀謗佛陀，因為他不了解我真正的意思。其實，所謂『說法』，根本沒有一個實體的法可以說，這才是真正的說法。」\n這時，須菩提問佛陀：「世尊，未來是否還會有人，聽了這樣的教法，生起信心呢？」\n佛回答：「須菩提，那些人既不能說是『眾生』，也不能說『不是眾生』。為什麼？因為如來所說的『眾生』，本來就不是指一個真實固定的存在，所以才說這樣的名相只是方便稱呼而已。」"
  },
  {
    "id": 22,
    "chapter": "第二十二品  無法可得分",
    "text": "須菩提白佛言：「世尊，佛得阿耨多羅三藐三菩提，為無所得耶？」\n佛言：「如是如是。須菩提，我於阿耨多羅三藐三菩提，乃至無有少法可得，是名阿耨多羅三藐三菩提。」",
    "note": "須菩提向佛請教：「世尊，您既然已經成就了無上的正等正覺，是不是因為其中根本沒有任何可取之法呢？」\n佛回應：「確實如此，須菩提。我所證悟的阿耨多羅三藐三菩提，乃至於任何法都無所可得，正是因為沒有一點可執著、可佔有，所以才稱它為『無上正等正覺』。」"
  },
  {
    "id": 23,
    "chapter": "第二十三品  淨心行善分",
    "text": "「復次，須菩提，是法平等，無有高下，是名阿耨多羅三藐三菩提。以無我、無人、無眾生、無壽者修一切善法，即得阿耨多羅三藐三菩提。須菩提，所言善法者，如來說即非善法，是名善法。」",
    "note": "「再說，須菩提，所有的法都一視同仁，沒有高低優劣，這就是真正的無上正等正覺。\n如果修行時不執著於『我』、『人』、『眾生』、『壽命』的觀念，所做的各種善行就能直接通向那無上正等正覺。\n須菩提，你聽人說的那些『善法』，實際上而且沒有固定不變的本質，只是暫時約定的名稱罷了。」"
  },
  {
    "id": 24,
    "chapter": "第二十四品  福智無比分",
    "text": "「須菩提，若三千大千世界中，所有諸須彌山王，如是等七寶聚，有人持用布施；若人以此《般若波羅蜜經》，乃至四句偈等，受持讀誦，為他人說，於前福德，百分不及一，百千萬億分，乃至算數、譬喻所不能及。」",
    "note": "佛說：「須菩提啊，假如有人把三千大千世界中所有如須彌山那麼高的七寶都拿來布施；而另一個人只是從這部《般若波羅蜜經》中受持了四句經文，而且且用心去誦讀，再分享給他人聽。那麼，前者累積的福報，再多也遠遠不及後者的百分之一。即使把數字加總到千萬億倍，甚至用比喻去形容，也無法接近後者的功德。」"
  },
  {
    "id": 25,
    "chapter": "第二十五品  化無所化分",
    "text": "「須菩提，於意云何？波等勿謂如來作是念：『我當度眾生。』須菩提，莫作是念！何以故？實無有眾生如來度者。若有眾生如來度者，如來即有我、人、眾生、壽者。」\n須菩提，如來說有我者，即非有我，而凡夫之人以為有我。須菩提，凡夫者，如來說即非凡夫，是名凡夫。」",
    "note": "佛問：「須菩提，你認為可以說如來心裡會這樣想：『我要度化眾生』嗎？」\n佛接著說：「千萬不要這麼想！為什麼？因為其實沒有哪一位眾生，是由如來真正『度化』的。\n如果真的有哪個眾生被我度了，那就等於我內心還有『我』、『他人』、『眾生』和『壽命長短』的分別。」\n「須菩提，當佛說『有我』時，而且不是在說真的有一個『我』；只是凡夫之人會誤以為那是真的。\n所謂的凡夫，佛也不是指真有這樣的人存在，只是依俗說法、暫時安立這樣的名稱罷了。」"
  },
  {
    "id": 26,
    "chapter": "第二十六品  法身非相分",
    "text": "「須菩提，於意云何？可以三十二相觀如來不？」\n須菩提言：「如是如是。以三十二相觀如來。」\n佛言：「須菩提，若以三十二相觀如來者，轉輪聖王即是如來。」\n須菩提白佛言：「世尊，如我解佛所說義，不應以三十二相觀如來。」\n爾時，世尊而說偈言：\n「若以色見我，以音聲求我，是人行邪道，不能見如來。」",
    "note": "須菩提，佛問他：「你認為能不能透過三十二種外在相貌來認識如來呢？」\n須菩提答道：「是的，我認為可以透過這三十二種特徵來認識如來。」\n佛說：「如果光靠這些外表特徵就能認識如來，那麼一位轉輪聖王也就可以稱為如來了。」\n須菩提對佛說：「依我理解佛陀的教法，不應該只靠這三十二種外貌特徵來認識如來。」\n這時，佛陀便以偈語補充說：\n「若有人透過外貌來看我，或以聲音來尋找我，這樣的人其實走錯了路，是無法真正見到如來的。」"
  },
  {
    "id": 27,
    "chapter": "第二十七品  無斷無滅分",
    "text": "「須菩提，汝若作是念：如來不以具足相故，得阿耨多羅三藐三菩提。須菩提，莫作是念。如來不以具足相故，得阿耨多羅三藐三菩提。須菩提，汝若作是念：發阿耨多羅三藐三菩提心者，説諸法斷滅。莫作是念！何以故？發阿耨多羅三藐三菩提心者，於法不說斷滅相。」",
    "note": "「須菩提，如果你心裡生起一個念頭，認為佛是因為沒有外在莊嚴相才成佛，那就錯了，不可以這樣想。佛是否有莊嚴相，而且不是成佛的條件。」\n「還有啊，如果你認為發願求無上正覺的人是在主張一切法終將斷滅，也不正確，為什麼？因為真正立志成佛的人，對世間的一切法，從不以『會滅絕』這種觀點來看待。」"
  },
  {
    "id": 28,
    "chapter": "第二十八品  不受不貪分",
    "text": "「須菩提，若菩薩以滿恆河沙等世界七寶持用布施，若復有人知一切法無我，得成於忍，此菩薩勝前菩薩所得功德。何以故？須菩提，以諸菩薩不受福德故。」\n須菩提白佛言：「世尊，云何菩薩不受福德？」\n「須菩提，菩薩所作福德，不應貪著，是故說不受福德。」",
    "note": "佛說：「須菩提啊，如果一位菩薩用滿滿如恆河沙數般多世界的七寶來布施，功德已經很大了。但如果有另一個人，能夠真正了解『一切法無我』的道理，而且因此達到忍辱不動的境界，那這個人的境界與功德，其實比前者還要高。」\n「為什麼會這樣呢？因為真正的菩薩，不會執著於自己所做的功德，也不會去期待什麼福報。」\n須菩提聽了便問：「世尊，那為什麼菩薩不接受福德呢？」\n佛回答：「菩薩對於自己所行的一切善行，不該有任何貪求與執著。所以說他們是不受福德的。」"
  },
  {
    "id": 29,
    "chapter": "第二十九品  威儀寂靜分",
    "text": "「須菩提，若有人言：『如來若來若去，若坐若臥。』是人不解我所說義。何以故？如來者，無所從來，亦無所去，故名如來。」",
    "note": "佛說：「須菩提，如果有人說：『如來會來、會去、會坐下、會躺下。』這樣說的人，其實完全不明白我真正的意思。」\n「為什麼這樣說呢？因為『如來』這個名稱，代表的意思是：他沒有從哪裡來，也沒有去哪裡。正因為超越來去的執著，所以稱為如來。」"
  },
  {
    "id": 30,
    "chapter": "第三十品  一合理相分",
    "text": "「須菩提，若善男子、善女人，以三千大千世界碎為微塵，於意云何？是微塵眾寧爲多不？」\n須菩提言：「甚多，世尊。何以故？若是微塵實有者，佛即不說是微塵眾。所以者何？佛說微塵眾，是名微塵眾。世尊，如來所說三千大千世界，即非世界，是名世界。何以故？若世界實有者，即是一合相。如來說一合相，即非一合相，是名一合相。」\n「須菩提，一合相者，即是不可說。但凡夫之人，貪著其事。」",
    "note": "佛陀對須菩提說：「如果有善男子或善女人，能將整個三千大千世界打碎成極微小的塵埃，你認為那些微塵多不多？」\n須菩提答道：「非常多，世尊。為什麼呢？如果那些微塵是真正存在的事物，佛就不會稱它們為『微塵之眾』了。佛之所以說它們是『微塵之眾』，只是借此名稱方便指代罷了。」\n佛繼續解釋：「同樣地，我所說的『三千大千世界』，也不是指一個真實不變的世界，那僅是約定俗成的名稱。如果世界真的牢牢存在，就應該叫它『一合相』，意即一體不分。但如來所說的『一合相』，卻而且非實有，也只是名相上的稱呼。」\n他補充道：「須菩提，這所謂的『一合相』，其實是無法用語言來表達的。一般凡夫執著於這個名相，就會生起貪黏之心。」"
  },
  {
    "id": 31,
    "chapter": "第三十一品  知見不生分",
    "text": "「須菩提，若人言：『佛說我見、人見、眾生見、壽者見。』須菩提，於意云何？是人解我所說義不？」\n「不也，世尊，是人不解如來所說義。何以故？世尊說我見、人見、眾生見、壽者見，即非我見、人見、眾生見、壽者見，是名我見、人見、眾生見、壽者見。」\n「須菩提，發阿耨多羅三藐三菩提心者，於一切法，應如是知，如是見，如是信解，不生法相。須菩提，所言法相者，如來說即非法相，是名法相。」",
    "note": "佛陀說：「須菩提，如果有人說：『佛陀曾經講過我相、人相、眾生相、壽者相這些觀念。』須菩提，你認為這個人有真正理解我所講的道理嗎？」\n須菩提回答說：「世尊，他而且沒有真正理解如來的意思。為什麼呢？因為如來所說的我相、人相、眾生相、壽者相，而且非實際上存在這些真實不變的相，只是暫時用這些名稱來說明而已。」\n佛陀接著說：「須菩提，凡是立志證得無上正等正覺的人，對一切法都應該以這種方式認識、觀察和深信，不應對任何法產生固定不變的觀念或執著。須菩提，我所說的『法相』，其實而且不是絕對實有的相，只是暫時用來表達的一個名詞罷了。」"
  },
  {
    "id": 32,
    "chapter": "第三十二品  應化非真分",
    "text": "「須菩提，若有人以滿無量阿僧祇世界七寶持用布施；若有善男子、善女人發菩提心者，持於此經，乃至四句偈等，受持讀誦、為人演說，其福勝彼。」\n「云何為人演說？不取於相，如如不動。何以故？一切有為法，如夢幻泡影，如露亦如電，應作如是觀。」佛說是經已，長老須菩提及諸比丘、比丘尼、優婆塞、優婆夷，一切世間天、人、阿修羅，聞佛所說，皆大歡喜，信受奉行。",
    "note": "須菩提尊者說：如果有人用那無量無邊世界中累積的七寶去行布施，或者有人同時生起求取菩提的心，持續恭敬地承持這部經典，甚至念誦到四句偈頌，再把它講給別人聽，這麼做所獲得的福報，遠勝前者。\n然後佛陀進一步解釋：如何向人說法？就要不執著任何相狀，心如本來不動；為什麼？因為世間所有有為之法，都像夢裡的景象、泡影，像露珠閃光或電光一現，都不是真實可住，只能這樣去觀察。\n佛陀說完，須菩提尊者與在座的僧眾、在家居士，乃至天、人、修羅各道眾生，聽後都歡喜贊同，真心信受而且立即奉行。"
  }
]